Core/src/src/InformationRegisters/РасчетАрендыКвартир/РасчетАрендыКвартир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетАрендыКвартир</name>
  <resources>
    <name>ПриходнаяНакладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентАрендыКвартиры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАрендыЗаКвартиру</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РасходнаяНакладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/CommonModules/РасчетАрендыКвартирСервер/Module.bsl
Функция ПолучитьПриходнуюНакладнуюИзРегистраРасчетАрендыКвартир(РасходнаяНакладная)
    ПЕРЕМ РЕЗ;
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетАрендыКвартир.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ИЗ
		|	РегистрСведений.РасчетАрендыКвартир КАК РасчетАрендыКвартир
		|ГДЕ
		|	РасчетАрендыКвартир.РасходнаяНакладная = &РасходнаяНакладная
		|	И НЕ РасчетАрендыКвартир.ПриходнаяНакладная.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РасходнаяНакладная", РасходнаяНакладная.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.ПриходнаяНакладная;
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(ЛОЖЬ);
	
    Возврат РЕЗ;
КонецФункции // ()

//Функция ПолучитьТаблицуПредоплатДляПриходнойНакладной(ПриходнаяНакладная,ДатаПроверки)
//	ПЕРЕМ РЕЗ;
//	
//	УстановитьПривилегированныйРежим(ИСТИНА);
//	
//	ВалютаУчета = Константы.ВалютаУчета.Получить();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//		|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//		|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
//		|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
//		|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаОстаток,
//		|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
//		|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщикамиОстатки
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
//		|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//		|		РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
//		|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//		|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
//		|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
//		|				,
//		|				Организация = &Организация
//		|					И Контрагент = &Контрагент
//		|					И Договор = &Договор
//		|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
//		|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
//		|		ДвиженияДокументаРасчетыСПоставщиками.Документ.Дата,
//		|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
//		|		КОНЕЦ,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
//		|		КОНЕЦ
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
//		|	ГДЕ
//		|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
//		|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
//		|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
//		|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
//		|		И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	РасчетыСПоставщикамиОстатки.Документ,
//		|	РасчетыСПоставщикамиОстатки.Заказ,
//		|	РасчетыСПоставщикамиОстатки.ДокументДата,
//		|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) < 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
//		|	МАКСИМУМ(КурсыВалют.Период) КАК Период,
//		|	КурсыВалют.Валюта КАК Валюта
//		|ПОМЕСТИТЬ ВременнаяТаблицаДатКурсовВалют
//		|ИЗ
//		|	РегистрСведений.КурсыВалют КАК КурсыВалют
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРасчетыСПоставщикамиОстатки КАК ВременнаяТаблицаРасчетыСПоставщикамиОстатки
//		|		ПО (ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ДокументДата >= КурсыВалют.Период)
//		|			И (КурсыВалют.Валюта = &ВалютаДокумента)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ДокументДата,
//		|	КурсыВалют.Валюта
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВременнаяТаблицаДатКурсовВалют.ДокументДата КАК ДокументДата,
//		|	КурсыВалютыДокумента.Период КАК Период,
//		|	КурсыВалютыДокумента.Валюта КАК Валюта,
//		|	КурсыВалютыДокумента.Курс КАК Курс,
//		|	КурсыВалютыДокумента.Кратность КАК Кратность
//		|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютНаДокументДата
//		|ИЗ
//		|	РегистрСведений.КурсыВалют КАК КурсыВалютыДокумента
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДатКурсовВалют КАК ВременнаяТаблицаДатКурсовВалют
//		|		ПО (ВременнаяТаблицаДатКурсовВалют.Период = КурсыВалютыДокумента.Период)
//		|			И (ВременнаяТаблицаДатКурсовВалют.Валюта = КурсыВалютыДокумента.Валюта)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.Документ КАК Документ,
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток,
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
//		|	ВременнаяТаблицаКурсыВалютНаДокументДата.Курс КАК Курс,
//		|	ВременнаяТаблицаКурсыВалютНаДокументДата.Кратность КАК Кратность
//		|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщикамиОстаткиСКурсамиВалют
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПоставщикамиОстатки КАК ВременнаяТаблицаРасчетыСПоставщикамиОстатки
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютНаДокументДата КАК ВременнаяТаблицаКурсыВалютНаДокументДата
//		|		ПО ВременнаяТаблицаРасчетыСПоставщикамиОстатки.ДокументДата = ВременнаяТаблицаКурсыВалютНаДокументДата.ДокументДата
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//		|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//		|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
//		|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
//		|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета) КАК СуммаУчета,
//		|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
//		|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
//		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Курс, КурсыВалютыУчета.Курс) КАК Курс,
//		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Кратность, КурсыВалютыУчета.Кратность) КАК Кратность
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
//		|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//		|		РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
//		|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//		|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
//		|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
//		|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Кратность, КурсыВалютыУчета.Кратность) / (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Курс, КурсыВалютыУчета.Курс) * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
//		|		РасчетыСПоставщикамиОстатки.Курс КАК Курс,
//		|		РасчетыСПоставщикамиОстатки.Кратность КАК Кратность
//		|	ИЗ
//		|		ВременнаяТаблицаРасчетыСПоставщикамиОстаткиСКурсамиВалют КАК РасчетыСПоставщикамиОстатки
//		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
//		|			ПО (ИСТИНА)) КАК РасчетыСПоставщикамиОстатки
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
//		|		ПО (ИСТИНА)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	РасчетыСПоставщикамиОстатки.Документ,
//		|	РасчетыСПоставщикамиОстатки.Заказ,
//		|	РасчетыСПоставщикамиОстатки.ДокументДата,
//		|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов,
//		|	КурсыВалютыУчета.Курс,
//		|	КурсыВалютыУчета.Кратность,
//		|	РасчетыСПоставщикамиОстатки.Курс,
//		|	РасчетыСПоставщикамиОстатки.Кратность
//		|
//		|ИМЕЮЩИЕ
//		|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) > 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ДокументДата";
//	
//	Запрос.УстановитьПараметр("ВалютаДокумента", ПриходнаяНакладная.ВалютаДокумента);
//	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
//	Запрос.УстановитьПараметр("Договор", ПриходнаяНакладная.Договор);
//	Запрос.УстановитьПараметр("Контрагент", ПриходнаяНакладная.Контрагент);
//	Запрос.УстановитьПараметр("Организация", ПриходнаяНакладная.Организация);
//	Запрос.УстановитьПараметр("Период", ДатаПроверки);
//	Запрос.УстановитьПараметр("Ссылка", ПриходнаяНакладная.Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	РЕЗ = РезультатЗапроса.Выгрузить();
//	
//	УстановитьПривилегированныйРежим(ЛОЖЬ);
//	
//	Возврат РЕЗ;
//КонецФункции // ()

Процедура ЗаполнитьПриходПоРасходнойНакладной(РасходнаяНакладная) ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ЛогикаДляПроверки = (
		ПолучитьФункциональнуюОпцию("РасчетАрендыКвартир") 
		И ЗначениеЗаполнено(РасходнаяНакладная.Договор) И РасходнаяНакладная.Договор.РасчетАрендыКвартир 
		И ЗначениеЗаполнено(РасходнаяНакладная.ВладелецКвартиры) 
		И ЗначениеЗаполнено(РасходнаяНакладная.ДоговорВладельцаКвартиры)
		И (РасходнаяНакладная.ПроцентАрендыКвартиры>0)
		И ЗначениеЗаполнено(РасходнаяНакладная.НоменклатураАрендыКвартиры) 
		И (РасходнаяНакладная.СуммаАрендыЗаКвартиру>0)
		);
	
	Если НЕ ЛогикаДляПроверки Тогда
	
		Возврат;
	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ПриходнаяНакладная = ПолучитьПриходнуюНакладнуюИзРегистраРасчетАрендыКвартир(РасходнаяНакладная);
		
		Если ЗначениеЗаполнено(ПриходнаяНакладная)Тогда
			ПриходнаяНакладнаяОбъект = ПриходнаяНакладная.ПолучитьОбъект();
		Иначе	
			ПриходнаяНакладнаяОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
		КонецЕсли;
		
		СтратегияЗаполнения = Новый Соответствие;
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ПриходнаяНакладнаяОбъект, РасходнаяНакладная.Ссылка, СтратегияЗаполнения);
		
		ПриходнаяНакладнаяОбъект.Дата = РасходнаяНакладная.Дата + 1;
		ПриходнаяНакладнаяОбъект.ДокументОснование = НЕОПРЕДЕЛЕНО;
		
		ПриходнаяНакладнаяОбъект.ДокументАрендыКвартиры = РасходнаяНакладная.Ссылка;
		
		Комментарий = НСТР("ru='# Сформирован автоматически документом: %1';ka='# ფორმირებულია ავტომატურად დოკუმენტით: %1 -ის';en='Automatically generated by document: %1'");
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, Строка(РасходнаяНакладная.Ссылка));
		ПриходнаяНакладнаяОбъект.Комментарий = Комментарий;
		
		ПриходнаяНакладнаяОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
		
		Если РасходнаяНакладная.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке 
			И УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПоставщикуВДокументахПоступления") Тогда
			ПриходнаяНакладнаяОбъект.Заказ = РасходнаяНакладная.Заказ;
		Иначе
			ПриходнаяНакладнаяОбъект.Заказ = Неопределено;
		КонецЕсли;
				
		ПриходнаяНакладнаяОбъект.Организация = РасходнаяНакладная.Организация;
		ПриходнаяНакладнаяОбъект.Контрагент = РасходнаяНакладная.ВладелецКвартиры;
		ПриходнаяНакладнаяОбъект.Договор = РасходнаяНакладная.ДоговорВладельцаКвартиры;
		//ПриходнаяНакладнаяОбъект.СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
		//ПриходнаяНакладнаяОбъект.Ячейка = ДанныеЗаполнения.Ячейка;
		
		ПриходнаяНакладнаяОбъект.ВалютаДокумента = РасходнаяНакладная.ВалютаАрендыКвартир;
		Если НЕ ЗначениеЗаполнено(ПриходнаяНакладнаяОбъект.ВалютаДокумента) Тогда
		
			ПриходнаяНакладнаяОбъект.ВалютаДокумента = РасходнаяНакладная.ДоговорВладельцаКвартиры.ВалютаРасчетов;
			
			Если НЕ ЗначениеЗаполнено(ПриходнаяНакладнаяОбъект.ВалютаДокумента) Тогда
				
				ПриходнаяНакладнаяОбъект.ВалютаДокумента = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
				
			КонецЕсли;
		
		КонецЕсли;
		
		СтруктураКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ПриходнаяНакладнаяОбъект.Дата, Новый Структура("Валюта", ПриходнаяНакладнаяОбъект.ВалютаДокумента));
		ПриходнаяНакладнаяОбъект.Курс = СтруктураКурсКратность.Курс;
		ПриходнаяНакладнаяОбъект.Кратность = СтруктураКурсКратность.Кратность;
		
		ПриходнаяНакладнаяОбъект.НДСВключатьВСтоимость = Истина;
		ПриходнаяНакладнаяОбъект.НалогообложениеНДС = РасходнаяНакладная.ВладелецКвартиры.НалогообложениеНДС;
		Если ЗначениеЗаполнено(РасходнаяНакладная.ДоговорВладельцаКвартиры.ВидЦен) Тогда
			
			ПриходнаяНакладнаяОбъект.ВидЦен = РасходнаяНакладная.ДоговорВладельцаКвартиры.ВидЦен;
			ПриходнаяНакладнаяОбъект.СуммаВключаетНДС = ПриходнаяНакладнаяОбъект.ВидЦен.ЦенаВключаетНДС;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РасходнаяНакладная.ДоговорВладельцаКвартиры.ВидЦенКонтрагента) Тогда
			
			ПриходнаяНакладнаяОбъект.ВидЦенКонтрагента = РасходнаяНакладная.ДоговорВладельцаКвартиры.ВидЦенКонтрагента;
			
		КонецЕсли;
		
		ПриходнаяНакладнаяОбъект.Подразделение = РасходнаяНакладная.Подразделение;
		
		// Заполнение табличной части документа.
		ПриходнаяНакладнаяОбъект.Запасы.Очистить();
		ПриходнаяНакладнаяОбъект.Расходы.Очистить();
		ПриходнаяНакладнаяОбъект.Предоплата.Очистить();
		
		УчитыватьНДФЛ = ПриходнаяНакладнаяОбъект.Договор.УчитыватьНДФЛ;
		
		// Заполняем данные по аренде
		СтрокаТабличнойЧасти = ПриходнаяНакладнаяОбъект.Расходы.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = РасходнаяНакладная.НоменклатураАрендыКвартиры;
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			
			СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ПриходнаяНакладнаяОбъект.Подразделение;
			
			СтрокаТабличнойЧасти.ВидУдержанияНДФЛ = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(ПриходнаяНакладнаяОбъект.Договор, "ВидУдержанияНДФЛ");
			СтрокаТабличнойЧасти.ВидУдержанияПФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(ПриходнаяНакладнаяОбъект.Дата, ПриходнаяНакладнаяОбъект.Контрагент, ПриходнаяНакладнаяОбъект.Договор);
			
			Если ЗначениеЗаполнено(ПриходнаяНакладнаяОбъект.НалогообложениеНДС) 
				И НЕ ПриходнаяНакладнаяОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				
				Если ПриходнаяНакладнаяОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					СтрокаТабличнойЧасти.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			Иначе
				СтрокаТабличнойЧасти.СтавкаНДС = ПриходнаяНакладнаяОбъект.Организация.СтавкаНДСПоУмолчанию;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.НаправлениеДеятельности = СтрокаТабличнойЧасти.Номенклатура.НаправлениеДеятельности;
			
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
			
			СтрокаТабличнойЧасти.Количество = 1;
			СтрокаТабличнойЧасти.Цена = РасходнаяНакладная.СуммаАрендыЗаКвартиру;
			Если СтрокаТабличнойЧасти.Цена > 0 Тогда
				
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
				
				КонтрагентЯвляетсяНеРезидентом = ЛОЖЬ;
				Если ЗначениеЗаполнено(ПриходнаяНакладнаяОбъект.Контрагент) Тогда
					КонтрагентЯвляетсяНеРезидентом = ПриходнаяНакладнаяОбъект.Контрагент.ЯвляетсяНеРезидентом;
				КонецЕсли;
				РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная("Цена", СтрокаТабличнойЧасти, ПриходнаяНакладнаяОбъект.СуммаВключаетНДС, КонтрагентЯвляетсяНеРезидентом);
				
			КонецЕсли;		
			
			СтрокаТабличнойЧасти.Проект = РасходнаяНакладная.Проект;
			
		КонецЕсли;
		
		ПриходнаяНакладнаяОбъект.СуммаДокумента = ПриходнаяНакладнаяОбъект.Запасы.Итог("Всего") + ПриходнаяНакладнаяОбъект.Расходы.Итог("Всего") + ПриходнаяНакладнаяОбъект.ЗатратыНаИмущество.Итог("Всего");
		
		//Заполнение таблицы "Предоплаты"
		//ТЗ_Предоплаты = ПолучитьТаблицуПредоплатДляПриходнойНакладной(ПриходнаяНакладнаяОбъект,РасходнаяНакладная.Дата);
		//Если ТипЗНЧ(ТЗ_Предоплаты) = Тип("ТаблицаЗначений") Тогда
		//
		//	Для каждого Строка_ТЗ_Предоплаты Из ТЗ_Предоплаты Цикл
		//	
		//		СтрокаТЧ_Предоплаты = ПриходнаяНакладнаяОбъект.Предоплата.Добавить();
		//		ЗаполнитьЗначенияСвойств(СтрокаТЧ_Предоплаты,Строка_ТЗ_Предоплаты);
		//	
		//	КонецЦикла;
		//
		//КонецЕсли;
		
		// Проводим
		ПриходнаяНакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		
		// Записываем в регистр сведений РасчетАрендыКвартир
		НаборЗаписей = РегистрыСведений.РасчетАрендыКвартир.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РасходнаяНакладная.Установить(РасходнаяНакладная.Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = РасходнаяНакладная.Дата;
		НоваяЗапись.РасходнаяНакладная = РасходнаяНакладная.Ссылка;
		НоваяЗапись.ПриходнаяНакладная = ПриходнаяНакладнаяОбъект.Ссылка;
		НоваяЗапись.СуммаДокумента = РасходнаяНакладная.СуммаДокумента;
		НоваяЗапись.СуммаНДС = РасходнаяНакладная.Запасы.Итог("СуммаНДС") + РасходнаяНакладная.СуммаНДСДоставки;
		НоваяЗапись.ПроцентАрендыКвартиры = РасходнаяНакладная.ПроцентАрендыКвартиры;
		НоваяЗапись.СуммаАрендыЗаКвартиру = ПриходнаяНакладнаяОбъект.СуммаДокумента;
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		
		СобытиеЖурналаРегистрации = НСТР("ru = 'Расчет аренды квартир. Ошибка создания Приходной накладной.';ka = 'Расчет аренды квартир. Ошибка создания Приходной накладной.';en = 'Расчет аренды квартир. Ошибка создания Приходной накладной.'");
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации,УровеньЖурналаРегистрации.Ошибка,Метаданные.ОбщиеМодули.РасчетАрендыКвартирСервер,РасходнаяНакладная,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(ЛОЖЬ);
	
КонецПроцедуры

Процедура РасчетАрендыКвартирОчисткаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		НачатьТранзакцию();
		
		Попытка
					
			ПриходнаяНакладная = ПолучитьПриходнуюНакладнуюИзРегистраРасчетАрендыКвартир(Источник.Ссылка);
			Если ЗначениеЗаполнено(ПриходнаяНакладная)Тогда
				
				ПриходнаяНакладнаяОбъект = ПриходнаяНакладная.ПолучитьОбъект();
				ПриходнаяНакладнаяОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.РасчетАрендыКвартир.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РасходнаяНакладная.Установить(Источник.Ссылка);
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			
			СобытиеЖурналаРегистрации = НСТР("ru = 'Расчет аренды квартир. Ошибка отмены проведения Приходной накладной.';ka = 'Расчет аренды квартир. Ошибка отмены проведения Приходной накладной.';en = 'Расчет аренды квартир. Ошибка отмены проведения Приходной накладной.'");
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации,УровеньЖурналаРегистрации.Ошибка,Метаданные.ОбщиеМодули.РасчетАрендыКвартирСервер,Источник,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Источник.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК ПриходнаяНакладная
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ДокументАрендыКвартиры = &Источник";
		
		Запрос.УстановитьПараметр("Источник", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПриходнаяНакладнаяОбъект = ВыборкаДетальныеЗаписи.ПриходнаяНакладная.ПолучитьОбъект();
			ПриходнаяНакладнаяОбъект.УстановитьПометкуУдаления(ИСТИНА);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
